Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/traffic_and_parking/traffic_wardens_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Responsibility for enforcing the law relating to illegal parking and stopping of motor vehicles rests with traffic wardens and an Garda Síochána
ga: Luíonn an fhreagracht as forfheidhmiú an dlí mar a bhaineann sé le páirceáil mhídhleathach agus le stopadh mótarfheithiclí le Maoir Thráchta agus leis an nGarda Síochána

source: Illegal parking and stopping of vehicles on public roads are considered traffic offences
ga: Meastar an pháirceáil mhídhleathach agus stopadh feithiclí ar bhóithre poiblí a bheith ina gcionta tráchta

source: Together with an Garda Síochána, traffic wardens are empowered to issue fixed-charge fines for these offences
ga: Bíonn an chumhacht ag maoir thráchta i dteannta leis an nGarda Síochána le socraithe-mhuirear fíneáil a ghearradh ar na cionta sin

source: Local authorities employ traffic wardens to monitor instances of these offences in their areas
ga: Fostaíonn údaráis áitiúila maoir thráchta chun monatóireacht a dhéanamh ar chásanna de na cionta sin ina gceantar

source: The principal legislation governing this area is the Local Authorities (Traffic Wardens) Act 1975 as amended
ga: Is í an phríomhreachtaíocht a rialaíonn an réimse seo ná an tAcht um Údaráis Áitiúla (Maoir Thráchta) 1975 mar atá leasaithe

source: The offences for which traffic wardens can issue fixed-charge fines are parking and motor tax disk offences, and are set out in the Local Authorities (Traffic Wardens) Act 1975 (Fixed Charge Offences) Regulations 2006 (SI 136/2006)
ga: Is féidir le maoir thráchta a eisiúint fíneálacha socraithe-mhuirear i leith cionta páirceála agus mótarcháin diosca, agus tá na cionta seo leagtha amach sna Rialacháin (Cionta Muirear Seasta) 2006 (IR 136/2006)

source: In situations where a traffic warden has reasonable grounds for believing someone is committing or has committed an offence, they may deliver a fixed-charge notice on a prescribed form
ga: Má bhíonn cúis réasúnach ag maor tráchta le creidiúint go bhfuil duine éigin i mbun ciona, nó tar éis ciona a dhéanamh, is féidir leis nó léi socraithe-mhuirear fógra a sheachadadh ar fhoirm fhorordaithe

source: This form is commonly known as a "parking ticket"
ga: Tugtar "ticéad páirceála" ar an bhfoirm sin sa ghnáthchaint

source: This form will state that you have committed an offence and will state the date, time and location of the offence and will detail your vehicle registration
ga: Déarfaidh an fhoirm seo go bhfuil cion déanta agat agus beidh dáta, am, agus áit an chiona chomh maith le sonraí do clárú feithicle

source: Most traffic wardens use a hand-held computerised device to issue tickets and the local authority keeps a record of all tickets issued in a main database
ga: Baineann an chuid is mó de na maoir thráchta úsáid as gaireas láimhe ríomhaireachta chun ticéid a eisiúint agus coinníonn an t-údarás áitiúil taifead de na ticéid ar fad a eisítear ar bhunachar sonraí lárnach

source: Using this database, the local authority can find out how many parking fines a particular individual has accumulated
ga: Is féidir leis an údarás áitiúil úsáid a bhaint as an mbunachar sonraí sin chun líon na bhfineálacha páirceála atá carntha ag duine ar leith a aimsiú

source: Parking is restricted in certain place
ga: Tá cosc ar pháirceáil in áiteanna áirithe

source: For example, in certain towns and cities, the local authorities have the power to restrict parking at certain times and in certain places
ga: Mar shampla, bíonn an cumhacht ag údaráis áitiúla i mbailte agus i gcathracha áirithe cosc a chur ar pháirceáil ag amanna ar leith agus in áiteanna ar leith

source: These parking restrictions are clearly indicated through signs clearly displayed at the roadside
ga: Bíonn na srianta páirceála seo taispeánta go soiléir ar fhógraí ag colbha an bhóthair

source: You can read more about parking fines and restrictions here
ga: Is féidir leat tuilleadh a léamh faoi fíneálacha agus srianta páirceála anseo

source: A system of fixed-charge fines for illegal parking and non-payment of parking fees is in place
ga: Tá córas socraithe-mhuirear fíneáil i bhfeidhm don pháirceáil mhídhleathach agus do neamh-íoc na dtáillí páirceála

source: Both traffic wardens and members of the Gardaí issue fines
ga: Eisíonn maoir thráchta agus baill den Gharda Síochána araon fíneálacha

source: The parking ticket will contain the following details: a reference number, the location of the offence, the registration number of the car, the amount of the fine and the date and time the ticket was issued
ga: Beidh na sonraí seo a leanas ar an ticéad páirceála: uimhir thagartha, áit an chiona, uimhir chláraithe an chairr, méid na fíneála agus an dáta agus an t-am ar ar eisíodh an ticéad

source: If you have been given a parking ticket or notified by a traffic warden of an offence, you have 28 days commencing on the beginning of the date of the notice to pay the fine
ga: Má thug maor tráchta ticéad páirceála nó fógra faoi chion duit, bíonn 28 lá agat a thosaíonn ag tús dháta an fhógra chun an fhíneáil a íoc

source: If it is not paid within 28 days, the fine is increased by 50% and if it is still unpaid after a further 28 days then court proceedings are initiated
ga: Mura n-íoctar é laistigh de 28 lá, méadaítear an fineáil faoi 50% agus mura n-íoctar ina dhiaidh sin é tar éis 28 lá sa bhreis air sin, cuirtear tús le himeachtaí cúirte

source: It is an offence to remove or interfere with a parking ticket that has been placed on the vehicle of another person
ga: Is cion é a chur isteach ar thicéad páirceála a cuireadh ar fheithicil duine eile nó é a bhaint de

source: If you do so, you could be liable to a fine
ga: Má dhéanann tú amhlaidh, d’fhéadfá a bheith faoi dhliteanas um fhíneáil

source: Anyone obstructing a traffic warden acting in the course of their duty is guilty of an offence and is liable on summary conviction to a fine
ga: Má chuireann éinne bac ar mhaor tráchta agus é nó í i mbun a gcuid oibre bíonn an té sin ciontach i gcoir agus faoi dhliteanas d’fhíneáil ar chiontú go hachomhair iad

source: Traffic wardens can request or demand your name and address
ga: Féadann maoir thráchta d’ainm agus do sheoladh a iarraidh nó a éileamh

source: They are obliged to carry identification with them and to identify themselves as traffic wardens
ga: Caithfidh siad aitheantas a thabhairt leo agus iad féin a chur in aithne mar mhaoir thráchta

source: Failure to give your name and address on demand is also an offence and you may be liable on a summary conviction to a fine
ga: Is cion é má mhainnítear chun ainm agus seoladh a thabhairt nuair a éilítear iad agus d’fhéadfá a bheith faoi dhliteanas fíneáil ar chiontú go hachomhair iad

source: Fixed charge fines for parking offences can range from €40 to €80, depending on the nature of the offence
ga: Gearrtar fíneálacha socraithe-mhuirear idir €40 agus €80, ag brath ar an gcion féin
